Домашняя_бухгалтерия.РасчетЗарплаты/src/InformationRegisters/РЗ_Хронометраж/РЗ_Хронометраж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЗ_Хронометраж</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.РЗ_Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Enums/РЗ_ВидыУчетаРабочегоВремени/РЗ_ВидыУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РЗ_ВидыУчетаРабочегоВремени</name>
  <enumValues>
    <name>Программирование</name>
  </enumValues>
  <enumValues>
    <name>Языки</name>
  </enumValues>
</mdclass:Enum>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_УчетРабочегоВремениНовый/РЗ_УчетРабочегоВремениНовый.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЗ_УчетРабочегоВремениНовый</name>
  <registerRecords>AccumulationRegister.РЗ_УчетРабочегоВремени</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.РЗ_ВидыУчетаРабочегоВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетВремени</name>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>CatalogRef.Контакты</types>
      </type>
    </attributes>
    <attributes>
      <name>Задача</name>
      <type>
        <types>CatalogRef.РЗ_Задачи</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_бухгалтерия.РасчетЗарплаты/src/InformationRegisters/РЗ_Хронометраж/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура НачалоВыполнения(Задача) Экспорт 
	МенеджерЗаписи = РегистрыСведений.РЗ_Хронометраж.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Прочитать();
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Задача = Задача;
		МенеджерЗаписи.ДатаНачала = ТекущаяДатаСеанса();
		МенеджерЗаписи.Записать();
	Иначе
		//Выполнение уже запущено
	КонецЕсли;
КонецПроцедуры

Процедура ЗавершениеВыполнения(Задача) Экспорт 

	//Закончить таймер и создать документ
	МенеджерЗаписи = РегистрыСведений.РЗ_Хронометраж.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		ВремяВыполнения = ТекущаяДатаСеанса() - МенеджерЗаписи.ДатаНачала;
		Часы = Окр(ВремяВыполнения / 3600, 2);
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
		ДанныеЗаполнения.Вставить("Видоперации", Перечисления.РЗ_ВидыУчетаРабочегоВремени.Программирование);
		ДанныеЗаполнения.Вставить("Комментарий", "По данным хронометража");
		ТаблицаЗначений = Новый ТаблицаЗначений;
		ТаблицаЗначений.Колонки.Добавить("Контакт");
		ТаблицаЗначений.Колонки.Добавить("Задача");
		ТаблицаЗначений.Колонки.Добавить("КоличествоЧасов");
		НоваяСтрока = ТаблицаЗначений.Добавить();
		НоваяСтрока.Контакт = Задача.Заказчик;
		НоваяСтрока.Задача = Задача;
		НоваяСтрока.КоличествоЧасов = Часы;
		ДанныеЗаполнения.Вставить("УчетВремени", ТаблицаЗначений);
		ДанныеЗаполнения.Вставить("Хронометраж", Истина);
		
		Документ = Документы.РЗ_УчетРабочегоВремениНовый.СоздатьДокумент();
		Документ.Заполнить(ДанныеЗаполнения);
		Документ.Записать(РежимЗаписиДокумента.Проведение);
		
		МенеджерЗаписи.Удалить();
	Иначе
		//Выполнение задачи не было запущено
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
